{"class_name": "Sequential", "config": {"name": "sequential_342", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "tcn_342_input"}}, {"class_name": "TCN", "config": {"name": "tcn_342", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10, 1], "nb_filters": 12, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": false, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}}, {"class_name": "Dense", "config": {"name": "dense_342", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.12.0", "backend": "tensorflow"}